export function getTextByService(number: number): string {
    const textMapping: { [key: number]: string } = {
        1: "育兒津貼",
        2: "托育補助",
        3: "孕婦補助",
        4: "孕婦補助",
        5: "單親家庭津貼",
        6: "學費減免",
        7: "獎助學金",
        8: "特殊教育支援",
        9: "低收入戶子女教育補助",
        10: "醫療補助",
        11: "長照補助",
        12: "精神健康補助",
        13: "特殊疾病醫療補助",
        14: "老人年金",
        15: "長者健保補助",
        16: "養老院或日照中心補助",
        17: "老人生活津貼",
        18: "低收入戶生活補助",
        19: "無家可歸者支援",
        20: "弱勢族群就業補助",
        21: "住房補助",
        22: "殘疾津貼",
        23: "無障礙設施補助",
        24: "無障礙設施補助",
        25: "身心障礙者就業補助",
        26: "居家照顧津貼",
        27: "就業津貼",
        28: "創業貸款補助",
        29: "技能培訓補助",
        30: "職業重建服務",
        31: "食物或糧食補助",
        32: "水電費補助",
        33: "營養午餐補助",
        34: "交通費補助",
        35: "租/賃屋補助",
        36: "弱勢兒童及少年醫療補助",
        37: "兒少保護通報",
        38: "原住民福利",
        39: "新住民福利",
        40: "退伍軍人福利",
        41: "性別平權相關補助"
    };

    return textMapping[number] || "對應文字不存在";
}

export function getTextByLocation(number: number): string {
    const textMapping: { [key: number]: string } = {
        1: "台北市",
        2: "新北市",
        3: "基隆市",
        4: "桃園市",
        5: "新竹市",
        6: "新竹縣",
        7: "苗栗縣",
        8: "台中市",
        9: "彰化縣",
        10: "雲林縣",
        11: "嘉義市",
        12: "嘉義縣",
        13: "台南市",
        14: "高雄市",
        15: "屏東縣",
        16: "南投縣",
        17: "宜蘭縣",
        18: "花蓮縣",
        19: "台東縣",
    };

    return textMapping[number] || "對應文字不存在";
}